In [ ]:
import pandas as pd
sales = [3000, 4000, 5000, 7000, 10000]
profits = [233, 788, 90, 855, 900]
products = ['P1', 'P2', 'P3', 'P4', 'P5']

In [ ]:
sales_series = pd.Series(sales, index = products)
profits_series = pd.Series(profits, index = products)

In [ ]:
sales_series

In [ ]:
profits_series

In [ ]:
# TO combine two series, we have to give each series a name and glue them together , that's when it becomes data

In [ ]:
# Dictionary is used a glue
pd.DataFrame({'sales':sales_series, 'profits': profits_series })

In [ ]:
qty_series = pd.Series([3,4,7,9,11], index = ['P1', 'P2', 'P3', 'P4', 'P5'])

In [ ]:
pd.DataFrame({'sales':sales_series, 'profits': profits_series, 'quantity':qty_series})

In [ ]:
sales = [3000, 4000, 5000, 7000, 10000]
profits = [233, 788, 90, 855, 900]
products = ['P1', 'P2', 'P3', 'P4', 'P5']
qty= [3,4,7,9,11]
# I don't want to convert them into Series and then glue, can I do it directly?

In [ ]:
# Products is now coming as a Data Series
pd.DataFrame({'sales': sales, 'profits': profits,  'quantity': qty, 'products': products})
# Lists became data series which were stacked together

In [ ]:
# What if you want products as indexes
df = pd.DataFrame({'sales': sales, 'profits': profits,  'quantity': qty}, index = products)
df

In [ ]:
# In this data frame - sales is what? - A data Series, profits - Data Series
df.index

In [ ]:
# What if I take out a row horizontally - what is it?
# A data Series
# For vertical data series indexes are indexes
# For horizontal data series - indexes are column names

In [ ]:
df

In [ ]:
# Now comes the question how do we take these data series out?
df['sales']
# How will you take out the horizontal data series
# You have to tell him that I want a row data series(horizontal data series) and not a column data series(vertical)
df.loc['P1']

In [ ]:
df = pd.DataFrame({'Total Sale': [1000,2000,3000, 4000], 'Total Profit': [100,200,300, 400]}, index = ['Store 1', 'Store 2', 'Store 3', 'Store 4'])
df

In [7]:
import pandas as pd
import numpy as np

# Set seed for reproducibility
np.random.seed(42)

# Generate sample data
data = {
    'ID': range(1, 51),  # 50 unique IDs
    'Name': ['Person_' + str(i) for i in range(1, 51)],  # Names from Person_1 to Person_50
    'Age': np.random.randint(18, 60, size=50),  # Random ages between 18 and 60
    'City': np.random.choice(['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'], size=50),
    'Score': np.random.uniform(0, 100, size=50)  # Random scores between 0 and 100
}

# Create the DataFrame
df = pd.DataFrame(data).head(20)
df

    ID       Name  Age         City      Score
0    1   Person_1   56     New York   6.355835
1    2   Person_2   46      Houston  31.098232
2    3   Person_3   32  Los Angeles  32.518332
3    4   Person_4   25      Houston  72.960618
4    5   Person_5   38  Los Angeles  63.755747
5    6   Person_6   56  Los Angeles  88.721274
6    7   Person_7   36      Houston  47.221493
7    8   Person_8   40      Phoenix  11.959425
8    9   Person_9   28  Los Angeles  71.324479
9   10  Person_10   28  Los Angeles  76.078505
10  11  Person_11   41      Houston  56.127720
11  12  Person_12   53  Los Angeles  77.096718
12  13  Person_13   57  Los Angeles  49.379560
13  14  Person_14   41      Houston  52.273283
14  15  Person_15   20      Houston  42.754102
15  16  Person_16   39     New York   2.541913
16  17  Person_17   19      Phoenix  10.789143
17  18  Person_18   41      Phoenix   3.142919
18  19  Person_19   47  Los Angeles  63.641041
19  20  Person_20   55      Phoenix  31.435598

In [ ]:
# Find the data series for index - 14
df.loc[14]

In [ ]:
# Find the data series for 'City'
df['City']

In [ ]:
# Give me City and Score together as Data Series
# Two data Series together will give me Data Frame
# DOn't do it
# df['City', 'Score']
df[['City', 'Score']]

In [ ]:
df['City']

In [ ]:
# Pull a single series but as a DataFRame
df[['City']]

In [ ]:
# Questions
# 1. Give Name as a Data Series
# 2. Give Name and City 
# 3. Give score as a DataFrame
df['Name']
df[['Name', 'City']]
df[['Score']]

In [ ]:
# Question
# Give me row number 3,4 together
# Give me row number 3 only as Data Series
# GIve me row number 3 only as DataFRame
df.loc[[3,4]]
df.loc[3]
df.loc[[3]]

In [ ]:
df['Score']

In [ ]:
df.loc[3]

In [ ]:
df.loc[[3]]

In [ ]:
# Data Series is neither horizontal nor vertical 
# So what is it?
# It is like water, it will the shape of the vessel - if you put in a row, it becomes horizontal, if you put it in column - vertical

In [ ]:
df

In [ ]:
# Pull the row number 3 to 9
# in Data Series - Last index - included
# In lists it is not included
# x:y -> acts like a list
df.loc[3:9]

In [ ]:
lst = [1,2,3,4,5,5]
# lst[0:4]

In [ ]:
# find all the details of those people whose age is >50
lolo = df['Age']>50
df.loc[lolo]

In [ ]:
# Find all the details of people whose age >50 and are from Los Angeles
lolo = (df['Age']>50) & (df['City'] == 'Los Angeles')
df.loc[lolo]

In [ ]:
# I want Name and Age of people from rows 5 and 6
dff = df.loc[[5,6]]
dff[['Name', 'Age']]
df.loc[[5,6]][['Name', 'Age']]

In [ ]:
# One more way- 
dff.loc[[5,6],['Name', 'Age']]

In [ ]:
df[['Name', 'Age']].loc[[5,6]]
# dff.loc[[5,6]]

In [ ]:
# Names of people from row number 5 to row number 11 as Data Series
# Names of people from row number 5 to row number 11 as Data Frame

In [ ]:
#Age and Score from row number 11 to row number 17 as Data Series
# Age row number 12 to row number 16 as Data Frame as Data Series

In [2]:
lolo = (df['Age']>50) & (df['City']=='Los Angeles')
df.loc[lolo]

    ID       Name  Age         City      Score
5    6   Person_6   56  Los Angeles  88.721274
11  12  Person_12   53  Los Angeles  77.096718
12  13  Person_13   57  Los Angeles  49.379560

In [ ]:
df

In [6]:
df = pd.DataFrame([1,2,3,4,5])
df[0:4]

   0
0  1
1  2
2  3
3  4

In [9]:
df.loc[0:4]

   ID      Name  Age         City      Score
0   1  Person_1   56     New York   6.355835
1   2  Person_2   46      Houston  31.098232
2   3  Person_3   32  Los Angeles  32.518332
3   4  Person_4   25      Houston  72.960618
4   5  Person_5   38  Los Angeles  63.755747